# Текстовый файл состоит не более чем из 10^6 символов A, B и C. 
# Определите максимальное количество идущих подряд символов C.
f=open('24_0.txt').readline()
k=0
s=0
for x in f:
    if x == 'C':
        k+=1
    else:
        s=max(k, s)
        k=0
s=max(k, s)
print(s)