# Текстовый файл состоит не более чем из 10^6 символов арабских цифр (0, 1, ..., 9). 
# Определите максимальное количество идущих подряд цифр, среди которых каждые две соседние различны.
f=open('24_1.txt').readline()
k=0
s=0
for i in range(0, len(f)-1):
    if f[i]!=f[i+1]:
        k+=1
        s=max(k, s)
    else:
        k=0
print(s+1)