# Текстовый файл содержит только заглавные буквы латинского алфавита (ABC…Z). 
# Определите максимальную длину непрерывного фрагмента, 
# который начинается и заканчивается одной и той же буквой из первой половины алфавита 
# (от A до M) и не содержит эту букву внутри.
f=open('24_4.txt').readline()
a=sorted('QWERTYUIOPASDFGHJKLZXCVBNM')[:13]
c=''
for i in a:
    b=f.split(i)
    c=max(b, key=len)
print(len(c))
    





