# Шифровка содержит только заглавные буквы латинского алфавита (ABC…Z). 
# Группа из трёх идущих подряд символов, содержащая по одному разу каждую из букв X, Y и Z, считается разделителем. 
# Разделители могут накладываться друг на друга, 
# например последовательность символов YZXYZ считается идущими подряд разделителями YZX, ZXY и XYZ.
# При дешифровке разделители удаляются, разбивая шифровку на фрагменты.
# Определите количество символов в самом длинном фрагменте шифровки, полученном после удаления разделителей.
f=open('24_6.txt').readline()
f = f.replace('XYZ', '*')
f = f.replace('*X', '*')
f = f.replace('XZY', '*')
f = f.replace('*X', '*')
f = f.replace('YXZ', '*')
f = f.replace('*Y', '*')
f = f.replace('YZX', '*')
f = f.replace('*Y', '*')
f = f.replace('ZXY', '*')
f = f.replace('*Z', '*')
f = f.replace('ZYX', '*')
f = f.replace('*Z', '*')
f = f.split('*')
b=max(f, key=len)
print(len(b))