# Текстовый файл состоит из цифр 0, 6, 7, 8, 9 и знаков арифметических операций «−» и «*» (вычитание и умножение). 
# Определите максимальное количество символов в непрерывной последовательности, 
# которая является корректным арифметическим выражением с целыми неотрицательными числами. 
# В этом выражении никакие два знака арифметических операций не стоят рядом, 
# в записи чисел отсутствуют незначащие (ведущие) нули и число 0 не имеет знака.
f=open('24_7.txt').readline()
f=f.replace('-', '*')
f=f.replace('*0*', '*3*')
while '**' in f:
    f = f.replace('**', '*x*')
f=f.replace('*0', 'x')
while 'x0' in f:
    f=f.replace('x0', 'x')
f=f.split('x')
s=0
for i in f:
    if  len(i) > 1:
        if i[0]=='*':
            i=i.replace('*', '', 1)
        if i[-1]=='*':
            i=i[:-1]
        s=max(len(i), s)
print(s)
f=f.replace